Revit 2026 API

# SpatialElementGetDefaultLocation Method

---

Gets the default location of the spatial element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetDefaultLocation()
```
```vb
Public Function GetDefaultLocation As XYZ
```
```cpp
public:
XYZ^ GetDefaultLocation()
```
```fsharp
member GetDefaultLocation : unit -> XYZ
```

#### Return Value

XYZ The default location of the spatial element.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The spatial element does not have a valid default location. |

The default location is a point where a spatial element is placed when it is created automatically without specifying a point. The default location of a spatial element is identical to the center of the bounding box if it is located inside the boundary, otherwise Revit will try to find a point that is guaranteed to be inside the boundary using an internal algorithm.

#### Reference

SpatialElement Class

Autodesk.Revit.DB Namespace